a=[[" ","_","_","_"," "],["|"," "," "," ","|"],["|"," "," "," ","|"],["|"," "," "," ","|"],[" ","_","_","_"," "]]
a[1][1]="O"
a[2][2]="O"
a[3][3]="O"
for i in range(len(a)):
    print(*a[i])


for i in range(1,4):
    if a[i][1] == "O" and a[i][2] == "O" and a[i][3] == "O":
        print("Победа за Игроком")
for j in range(1,4):
    if a[1][j] == "O" and a[2][j] == "O" and a[3][j] == "O":
        print("Победа за Игроком")
if a[1][1] == "O" and a[2][2] == "O" and a[3][3] == "O":
    print("Победа за Игроком")
if a[3][1] == "O" and a[2][2] == "O" and a[1][3] == "O":
    print("Победа за Игроком")